BOT_NAME="Jujutsu Kaisen Bot"
BOT_TOKEN = ""
GUILD_ID = "1285592988919140362"
GUILD_NAME="JUJUTSU KAISEN RP"
OWNER_NAME="The - Snow"

PERMISSIONS = {
    "персонаж": ["Анкетолог", "Куратор Анкетирования", "Управляющий", "Создатель"],
    "инвентарь": ["GameMaster", "Куратор RP", "Управляющий", "Создатель", "EventMaker"]
}

DICE_CATEGORIES = {
    "Клан": {
        "Отсутствует": 0.53,
        "Камо": 0.15,
        "Дзенин": 0.08,
        "Инумаки": 0.08,
        "Гето": 0.06,
        "Фудзивара": 0.05,
        "Годжо": 0.04,
        "Рёмен": 0.01
    },
    "Титул": {
        "Отсутствует": 0.65,
        "Мастер боя": 0.08,
        "Чудовище": 0.04,
        "Бывший ученик Киото": 0.05,
        "Мастер барьеров": 0.03,
        "Проклятый": 0.03,
        "Зайчик": 0.04,
        "Жалкая обезьяна": 0.04,
        "Неубиваемый": 0.02,
        "Одарённый": 0.01,
        "Король проклятий": 0.01
    },
    "Проклятье": {
        "Отсутствует": 0.85,
        "Небесное ограничение": 0.1,
        "Небесное ограничение": 0.05
    },
    "Свойство проклятой энергии": {
        "Отсутствует": 0.57,
        "Некачественная": 0.15,
        "Скрытная": 0.08,
        "Экономная": 0.07,
        "Грубая": 0.06,
        "Лечебная": 0.04,
        "Электрическая": 0.02,
        "Кастомная": 0.01
    }
}

TECHNIQUES_CHANCES = {
    "Камо": {
        "Отсутствует": 0.3,
        "Манипуляция кровью": 0.7
    },
    "Дзенин": {
        "Отсутствует": 0.45,
        "Проекция": 0.4,
        "10 теней": 0.15
    },
    "Инумаки": {
        "Отсутствует": 0.7,
        "Проклятая речь": 0.3
    },
    "Гето": {
        "Отсутствует": 0.85,
        "Манипуляция проклятьями": 0.15
    },
    "Фудзивара": {
        "Отсутствует": 0.9,
        "Копирование": 0.1
    },
    "Годжо": {
        "Отсутствует": 0.79,
        "Бесконечность": 0.15,
        "6 глаз": 0.05,
        "Бесконечность + 6 глаз": 0.01
    },
    "Рёмен": {
        "Отсутствует": 0.85,
        "Стрела Ашуры": 0.15
    }
}

RANKS = {
    0: "N/A",
    2: "F",
    4: "E",
    6: "D",
    8: "C",
    12: "B",
    14: "A",
    18: "S",
    22: "SS",
    26: "SSS",
    32: "SR",
    38: "SSR",
    44: "UR",
    50: "LR",
    56: "MR",
    64: "X",
    72: "XX",
    80: "XXX",
    90: "EX",
    100: "+++EX"
}

TECHNIQUE_LIBRARIES = {
    0: "Отсутствует",
    1: "Низкий уровень владения",
    2: "Средний уровень владения",
    3: "Высокий уровень владения",
    4: "Абсолютный уровень владения"
}
